{"id": "2507.22391", "title": "Knowledge engineering for open science: Building and deploying knowledge bases for metadata standards", "url": "https://arxiv.org/abs/2507.22391", "pdf": "https://arxiv.org/pdf/2507.22391", "abs": "https://arxiv.org/abs/2507.22391", "authors": ["Mark A. Musen", "Martin J. O'Connor", "Josef Hardi", "Marcos Martinez-Romero"], "categories": ["cs.DL", "H.3.7"], "comment": "22 pages, 7 figures", "summary": "Scientists strive to make their datasets available in open repositories, with\nthe goal that they be findable, accessible, interoperable, and reusable (FAIR).\nAlthough it is hard for most investigators to remember all the guiding\nprinciples associated with FAIR data, there is one overarching requirement: The\ndata need to be annotated with rich, discipline-specific, standardized\nmetadata. The Center for Expanded Data Annotation and Retrieval (CEDAR) builds\ntechnology that enables scientists to encode metadata standards as templates\nthat enumerate the attributes of different kinds of experiments. These metadata\ntemplates capture preferences regarding how data should be described and what a\nthird party needs to know to make sense of the datasets. CEDAR templates\ndescribing community metadata preferences have been used to standardize\nmetadata for a variety of scientific consortia. They have been used as the\nbasis for data-annotation systems that acquire metadata through Web forms or\nthrough spreadsheets, and they can help correct metadata to ensure adherence to\nstandards. Like the declarative knowledge bases that underpinned intelligent\nsystems decades ago, CEDAR templates capture the knowledge in symbolic form,\nand they allow that knowledge to be applied in a variety of settings. They\nprovide a mechanism for scientific communities to create shared metadata\nstandards and to encode their preferences for the application of those\nstandards, and for deploying those standards in a range of intelligent systems\nto promote open science."}
